'''
조건문
    특정 조건을 만족하는지 여부에 따라서
    실행하는 코드가 달라야 할 때 사용한다.
    주의할 사항은 들여쓰기를 사용하여 코드의 범위 정의

    1. if(조건식) :
         (조건식이 참) 실행할 코드
    2. if(조건식) :
         (조건식이 참) 실행할 코드
       else :
         (조건식이 거짓) 실행할 코드
    3. if(조건식 1) :
          (조건식1 참) 실행할 코드
       elif(조건식 2) :
          (조건식2 참) 실행할 코드
       elif(조건식 3) :
          (조건식3 참) 실행할 코드
       else :
          (조건식 모두 거짓) 실행할 코드
'''

# if, else 사용하기
a = 200
b = 100
if b > a :
    print("b는 a보다 크다")
else :
    print("b는 a보다 작다")

c = 20
d = 3

# if, elif 사용하기

if d == 1 :
    print("1")
elif d == 2 :
    print("2")
elif d == 3 :
    print("3")
else :
    print("1,2,3 모두 아니다")



